# Pandas Week 2

# 5. Membalik urutan baris dan kolom pada Data Frame

In [ ]:
#import modules
import pandas as pd
import numpy as np 

#check Version
print(pd.__version__)
print(pd.__version__)

In [2]:
#Data Frame Prep
n_rows= 5
n_cols=5
cols= tuple('ABCDE')
df=pd.DataFrame(np.random.randint(1,10, size=(n_rows,n_cols)),
                columns=cols)
df

   A  B  C  D  E
0  3  4  2  5  1
1  1  5  8  5  7
2  1  8  8  7  9
3  8  8  2  1  6
4  7  7  4  4  2

# Membalik Urutan Kolom

In [4]:
df.loc[:,::-1]
#bagian pertama mengatur baris (:(bila tidak ada angka pada sebelum dan sesudah titik dua(:) berarti kita menyertakan seluruh baris ))
#bagian kedua mengatur kolom (::-1(sama seperti bagian pertama hanya saja -1 digunakan untuk membalik urutan))

   E  D  C  B  A
0  1  5  2  4  3
1  7  5  8  5  1
2  9  7  8  8  1
3  6  1  2  8  8
4  2  4  4  7  7

# Membalik Urutan Baris

In [6]:
df.loc[::-1]#versi penyingkatan
#df.loc[::-1]--> Versi lengkap
#tidak perlu seperti membalik kolom karena bagian mengatur baris merupakan ruas pertama

   A  B  C  D  E
4  7  7  4  4  2
3  8  8  2  1  6
2  1  8  8  7  9
1  1  5  8  5  7
0  3  4  2  5  1

# Membalik Urutan Baris dan Melakukan penyesuain index

In [7]:
df.loc[::-1].reset_index(drop=True)
#balik urutannya kemudian gunakan reset_index(drop=True)(artinya index yang lama dibuang)

   A  B  C  D  E
0  7  7  4  4  2
1  8  8  2  1  6
2  1  8  8  7  9
3  1  5  8  5  7
4  3  4  2  5  1

# 6. Rename nama kolom pada Data Frame

In [8]:
#import modules
import pandas as pd
import numpy as np 

#check Version
print(pd.__version__)
print(pd.__version__)

1.1.3
1.1.3

In [9]:
#Data Frame Prep
c_rows= 5
c_cols=5
cols= tuple('ABCDE')
cf=pd.DataFrame(np.random.randint(1,10, size=(c_rows,c_cols)),
                columns=cols)
cf

   A  B  C  D  E
0  8  5  2  3  5
1  2  2  2  2  5
2  5  3  2  7  5
3  3  7  3  2  1
4  7  2  9  2  2

# Mengganti nama untuk sebuah kolom

In [10]:
cf.rename(columns={'C':'Hobby'})
#dictionary bisa diisi dengan banyak pasangan key and values (contohnya ada di bagian dibawah ini) untuk mengubah nama untuk banyak kolom

   A  B  Hobby  D  E
0  8  5      2  3  5
1  2  2      2  2  5
2  5  3      2  7  5
3  3  7      3  2  1
4  7  2      9  2  2

# Mengganti nama untuk banyak kolom

In [12]:
cf.rename(columns={'C':'C.City','A':'ID','B':'qty','D':'C.add','E':'C.plc'})

   ID  qty  C.City  C.add  C.plc
0   8    5       2      3      5
1   2    2       2      2      5
2   5    3       2      7      5
3   3    7       3      2      1
4   7    2       9      2      2

# 7. Menghapus missing values pada Data Frame

In [13]:
#import modules
import pandas as pd
import numpy as np 

#check Version
print(pd.__version__)
print(pd.__version__)

1.1.3
1.1.3

In [14]:
#Data Frame Prep

In [15]:
mf=pd.util.testing.makeMissingDataframe().reset_index()#membuat data frame dummy yang isinya terdapat missing value
#reset_index() agar dapat membuat index baru sehingga index lama dianggap sebagi kolom biasa
mf.head()#menampilkan lima data pertama|

C:\Users\Markvinson\anaconda3\lib\site-packages\pandas\util\__init__.py:12: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing

        index         A         B         C         D
0  tJPn9yWRwj  1.034840 -0.085830 -1.499815       NaN
1  sKEDoibl2x  0.331469 -0.537019 -0.205453  0.128407
2  mq79YdHCz6  1.538355 -1.215758  1.544279 -1.186530
3  7AgNhdD5kl  0.391896       NaN       NaN  0.400406
4  demtFaatGb -0.100732 -0.382965 -0.302181  0.891337

In [16]:
mf=mf.rename(columns={'index':'Z'})#mengubah nama kolom index menjadi 'Z'(lihat nomor 6)
mf.head()

            Z         A         B         C         D
0  tJPn9yWRwj  1.034840 -0.085830 -1.499815       NaN
1  sKEDoibl2x  0.331469 -0.537019 -0.205453  0.128407
2  mq79YdHCz6  1.538355 -1.215758  1.544279 -1.186530
3  7AgNhdD5kl  0.391896       NaN       NaN  0.400406
4  demtFaatGb -0.100732 -0.382965 -0.302181  0.891337

In [17]:
mf_backup=mf.copy(deep=True)#membuat copian data frame dari variable mf di variabel mf_backup

# Menghapus(mendrop) setiap kolom yang mengandung missing values

In [19]:
mf=mf.dropna(axis='columns')#mendrop atau menghapus kolom yang memiliki missing values(NaN)
mf.head()

            Z
0  tJPn9yWRwj
1  sKEDoibl2x
2  mq79YdHCz6
3  7AgNhdD5kl
4  demtFaatGb

# Menghapus(mendrop) setiap baris yang mengandung missing values

In [21]:
mf=mf_backup.copy(deep=True)#menggunakan data awal yang sudah dibuat dengan menggunakan copy-an nya
mf=mf.dropna(axis='rows')#mendrop atau menghapus baris yang memiliki missing values(NaN)
mf.head()

            Z         A         B         C         D
1  sKEDoibl2x  0.331469 -0.537019 -0.205453  0.128407
2  mq79YdHCz6  1.538355 -1.215758  1.544279 -1.186530
4  demtFaatGb -0.100732 -0.382965 -0.302181  0.891337
5  nSAtVYcbfZ  1.177951 -0.588461  0.303591  1.391835
7  3FVj63HKOR -1.080338 -0.163350  0.191238  0.354344

# Persentase missing values untuk setiap kolom

In [22]:
mf=mf_backup.copy(deep=True)#menggunakan data awal yang sudah dibuat dengan menggunakan copy-an nya
mf.isna().mean()#menghitung presentase missing values untuk setiap kolom
#presentase ini akan digunakan di bagian berikutnya

Z    0.000000
A    0.133333
B    0.066667
C    0.066667
D    0.133333
dtype: float64

# Menghapus(mendrop) setiap kolom yang mengandung missing values berdasarkan threshold

In [24]:
batas=len(mf) * 0.9 #menentukan ambang batas untuk kolom yang akan dihapus
#angka 0.9 (90%) bisa diubah menjadi angka presentase lainnya
mf=mf.dropna(thresh=batas, axis='columns')#menghapus kolom betasarkan batasnya
mf.head()

            Z         B         C
0  tJPn9yWRwj -0.085830 -1.499815
1  sKEDoibl2x -0.537019 -0.205453
2  mq79YdHCz6 -1.215758  1.544279
3  7AgNhdD5kl       NaN       NaN
4  demtFaatGb -0.382965 -0.302181

source: https://www.youtube.com/playlist?list=PL2O3HdJI4voGdD_9xhVCTBoDTDNHpajm5